{"class_name": "Model", "keras_version": "2.2.2", "backend": "tensorflow", "config": {"name": "model_13", "input_layers": [["input1", 0, 0]], "layers": [{"name": "input1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"sparse": false, "name": "input1", "dtype": "float32", "batch_input_shape": [null, 300]}}, {"name": "embedding_15", "class_name": "Embedding", "inbound_nodes": [[["input1", 0, 0, {}]]], "config": {"trainable": true, "mask_zero": false, "output_dim": 300, "name": "embedding_15", "embeddings_regularizer": null, "dtype": "float32", "input_length": 300, "batch_input_shape": [null, 300], "embeddings_constraint": null, "activity_regularizer": null, "input_dim": 22347, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}}}, {"name": "conv1d_38", "class_name": "Conv1D", "inbound_nodes": [[["embedding_15", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "dilation_rate": [1], "padding": "same", "data_format": "channels_last", "filters": 128, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1], "name": "conv1d_38", "kernel_size": [8], "bias_constraint": null}}, {"name": "max_pooling1d_38", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_38", 0, 0, {}]]], "config": {"padding": "valid", "name": "max_pooling1d_38", "trainable": true, "strides": [2], "pool_size": [2]}}, {"name": "spatial_dropout1d_38", "class_name": "SpatialDropout1D", "inbound_nodes": [[["max_pooling1d_38", 0, 0, {}]]], "config": {"name": "spatial_dropout1d_38", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.3}}, {"name": "batch_normalization_38", "class_name": "BatchNormalization", "inbound_nodes": [[["spatial_dropout1d_38", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_38", "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv1d_39", "class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_38", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "dilation_rate": [1], "padding": "same", "data_format": "channels_last", "filters": 256, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1], "name": "conv1d_39", "kernel_size": [8], "bias_constraint": null}}, {"name": "max_pooling1d_39", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_39", 0, 0, {}]]], "config": {"padding": "valid", "name": "max_pooling1d_39", "trainable": true, "strides": [2], "pool_size": [2]}}, {"name": "spatial_dropout1d_39", "class_name": "SpatialDropout1D", "inbound_nodes": [[["max_pooling1d_39", 0, 0, {}]]], "config": {"name": "spatial_dropout1d_39", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.3}}, {"name": "batch_normalization_39", "class_name": "BatchNormalization", "inbound_nodes": [[["spatial_dropout1d_39", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_39", "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "conv1d_40", "class_name": "Conv1D", "inbound_nodes": [[["batch_normalization_39", 0, 0, {}]]], "config": {"trainable": true, "activation": "relu", "dilation_rate": [1], "padding": "same", "data_format": "channels_last", "filters": 384, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_regularizer": null, "strides": [1], "name": "conv1d_40", "kernel_size": [8], "bias_constraint": null}}, {"name": "max_pooling1d_40", "class_name": "MaxPooling1D", "inbound_nodes": [[["conv1d_40", 0, 0, {}]]], "config": {"padding": "valid", "name": "max_pooling1d_40", "trainable": true, "strides": [2], "pool_size": [2]}}, {"name": "spatial_dropout1d_40", "class_name": "SpatialDropout1D", "inbound_nodes": [[["max_pooling1d_40", 0, 0, {}]]], "config": {"name": "spatial_dropout1d_40", "noise_shape": null, "trainable": true, "seed": null, "rate": 0.3}}, {"name": "batch_normalization_40", "class_name": "BatchNormalization", "inbound_nodes": [[["spatial_dropout1d_40", 0, 0, {}]]], "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "trainable": true, "name": "batch_normalization_40", "gamma_regularizer": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_constraint": null, "axis": -1, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true}}, {"name": "lstm_38", "class_name": "LSTM", "inbound_nodes": [[["batch_normalization_40", 0, 0, {}]]], "config": {"return_state": false, "dropout": 0.3, "recurrent_dropout": 0.3, "use_bias": true, "stateful": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "unit_forget_bias": true, "return_sequences": true, "recurrent_constraint": null, "implementation": 1, "trainable": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "name": "lstm_38", "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 180, "unroll": false, "bias_regularizer": null}}, {"name": "lstm_39", "class_name": "LSTM", "inbound_nodes": [[["lstm_38", 0, 0, {}]]], "config": {"return_state": false, "dropout": 0.3, "recurrent_dropout": 0.3, "use_bias": true, "stateful": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "unit_forget_bias": true, "return_sequences": true, "recurrent_constraint": null, "implementation": 1, "trainable": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "name": "lstm_39", "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 180, "unroll": false, "bias_regularizer": null}}, {"name": "lstm_40", "class_name": "LSTM", "inbound_nodes": [[["lstm_39", 0, 0, {}]]], "config": {"return_state": false, "dropout": 0.3, "recurrent_dropout": 0.3, "use_bias": true, "stateful": false, "go_backwards": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "recurrent_constraint": null, "implementation": 1, "trainable": true, "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_regularizer": null, "name": "lstm_40", "activation": "tanh", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "units": 180, "unroll": false, "bias_regularizer": null}}, {"name": "dense_24", "class_name": "Dense", "inbound_nodes": [[["lstm_40", 0, 0, {}]]], "config": {"trainable": true, "activation": "softmax", "kernel_regularizer": null, "name": "dense_24", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "units": 128, "bias_regularizer": null}}, {"name": "dense_25", "class_name": "Dense", "inbound_nodes": [[["dense_24", 0, 0, {}]]], "config": {"trainable": true, "activation": "softmax", "kernel_regularizer": null, "name": "dense_25", "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "units": 5, "bias_regularizer": null}}], "output_layers": [["dense_25", 0, 0]]}}