{"config": [{"config": {"dtype": "float32", "output_dim": 300, "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "input_dim": 30000, "input_length": 350, "batch_input_shape": [null, 350], "activity_regularizer": null, "trainable": true, "mask_zero": false, "embeddings_constraint": null, "embeddings_regularizer": null, "name": "embedding_50"}, "class_name": "Embedding"}, {"config": {"rate": 0.4, "seed": null, "trainable": true, "noise_shape": null, "name": "spatial_dropout1d_49"}, "class_name": "SpatialDropout1D"}, {"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_regularizer": null, "units": 196, "use_bias": true, "go_backwards": false, "unit_forget_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "stateful": false, "dropout": 0.2, "recurrent_dropout": 0.2, "unroll": false, "name": "lstm_49", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "implementation": 1, "return_sequences": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "recurrent_activation": "hard_sigmoid", "return_state": false}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "activity_regularizer": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "activation": "softmax", "units": 2, "name": "dense_51"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}