{"backend": "tensorflow", "config": [{"config": {"input_dim": 25279, "dtype": "float32", "embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "name": "embedding_3", "trainable": false, "activity_regularizer": null, "embeddings_regularizer": null, "batch_input_shape": [null, 300], "mask_zero": false, "input_length": 300, "output_dim": 300}, "class_name": "Embedding"}, {"config": {"activation": "relu", "use_bias": true, "padding": "same", "filters": 50, "activity_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_constraint": null, "name": "conv1d_3", "trainable": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [8], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1], "strides": [1], "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Conv1D"}, {"config": {"trainable": true, "pool_size": [2], "name": "max_pooling1d_3", "padding": "valid", "strides": [2]}, "class_name": "MaxPooling1D"}, {"config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.2, "name": "spatial_dropout1d_3"}, "class_name": "SpatialDropout1D"}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "epsilon": 0.001, "trainable": true, "center": true, "beta_constraint": null, "name": "batch_normalization_3", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "gamma_regularizer": null, "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "units": 196, "name": "lstm_3", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "implementation": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": false, "return_sequences": false, "recurrent_dropout": 0.2, "go_backwards": false, "use_bias": true, "unroll": false, "dropout": 0.2, "activity_regularizer": null, "bias_regularizer": null, "return_state": false, "trainable": true, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "LSTM"}, {"config": {"activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "units": 5, "name": "dense_3", "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.2.2"}